-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3307
-- Время создания: Мар 30 2022 г., 10:27
-- Версия сервера: 10.4.22-MariaDB
-- Версия PHP: 8.1.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `library1`
--

-- --------------------------------------------------------

--
-- Структура таблицы `book`
--

CREATE TABLE `book` (
  `N` int(10) NOT NULL,
  `Код` int(10) NOT NULL,
  `Новинка` tinytext NOT NULL DEFAULT 'No',
  `Назва` varchar(128) NOT NULL,
  `Ціна` float DEFAULT NULL CHECK (`Ціна` >= 0),
  `Видавництво` text NOT NULL,
  `Сторінки` int(3) NOT NULL,
  `Формат` varchar(10) NOT NULL,
  `Дата` date DEFAULT NULL,
  `Тираж` int(5) NOT NULL DEFAULT 5000,
  `Тема` text NOT NULL,
  `Категорія` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `book`
--

INSERT INTO `book` (`N`, `Код`, `Новинка`, `Назва`, `Ціна`, `Видавництво`, `Сторінки`, `Формат`, `Дата`, `Тираж`, `Тема`, `Категорія`) VALUES
(2, 5110, 'No', 'Апаратні засоби мультимедіа. Відеосистема PC ', 15.51, 'Видавнича група BHV', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Підручники\r'),
(8, 4985, 'No', 'Засвой самостійно модернізацію та ремонт Пк за 24 години, 2-ге вид. ', 18.9, 'Вільямс', 288, '70х100/16', '2000-07-07', 5000, 'Використання ПК в цілому', 'Підручники\r'),
(9, 5141, 'No', 'Структури даних та алгоритми', 37.8, 'Вільямс', 384, '70х100/16', '2000-09-29', 5000, 'Використання ПК в цілому', 'Підручники\r'),
(20, 5127, 'No', 'Автоматизація інженерно-графічних робіт', 11.58, 'Видавнича група BHV', 256, '70х100/16', '2000-06-15', 5000, 'Використання ПК в цілому', 'Підручники\r'),
(31, 5110, 'No', 'Апаратні засоби мультимедіа. Відеосистема РС', 15.51, 'Видавнича група BHV', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК\r'),
(46, 5199, 'No', 'Залізо IBM 2001', 30.07, 'МикроАрт', 368, '70х100/16', '2000-02-12', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК\r'),
(50, 3851, 'Yes', 'Захист інформації та безпека комп\'ютерних систем ', 26, 'DiaSoft', 480, '84х108/16', '2022-03-17', 5000, 'Використання ПК в цілому', 'Захист і безпека ПК \r'),
(56, 3789, 'No', '22 століття. Що нас очікує?', 21.23, 'ДМК', 235, '84х108/16', '2002-03-03', 5000, 'Інше', 'Інші книги'),
(58, 3932, 'No', 'Як перетворити персональний комп\'ютер на вимірювальний комплекс ', 7.65, 'ДМК', 144, '60х88/16', '1999-06-09', 5000, 'Використання ПК в цілому', 'Інші книги\r'),
(59, 4713, 'No', 'Plug-ins. Додаткові програми для музичних програм ', 11.41, 'ДМК', 144, '70х100/16', '2000-02-22', 5000, 'Використання ПК в цілому', 'Інші книги\r'),
(175, 5217, 'No', 'Windows МЕ. Найновіші версії програм', 16.57, 'Триумф', 320, '70х100/16', '2000-08-25', 5000, 'Операційні системи', 'Windows 2000\r'),
(176, 4829, 'No', 'Windows 2000 Professional крок за кроком з CD', 27.25, 'Эком', 320, '70х100/16', '2000-04-28', 5000, 'Операційні системи', 'Windows 2000\r'),
(188, 5170, 'No', 'Linux версії', 24.43, 'ДМК', 346, '70х100/16', '2000-09-29', 5000, 'Операційні системи', 'Linux\r'),
(191, 860, 'No', 'Операційна система UNIX', 3.5, 'Видавнича група BHV', 395, '84х100/16', '1997-05-05', 5000, 'Операційні системи', 'Unix\r'),
(206, 5176, 'No', 'Windows Ме. Супутник користувача', 12.79, 'Видавнича група BHV', 306, '', '2000-10-10', 5000, 'Операційні системи', 'Інші операційні системи\r'),
(209, 5462, 'No', 'Мова програмування С++. Лекції та вправи', 29, 'DiaSoft', 656, '84х108/16', '2000-12-12', 5000, 'Програмування', 'C&C++\r'),
(210, 4982, 'No', 'Мова програмування С. Лекції та вправи', 29, 'DiaSoft', 432, '84х108/16', '2000-07-12', 5000, 'Програмування', 'C&C++\r'),
(220, 4687, 'No', 'Ефективне використання C++ .50 рекомендацій щодо покращення ваших програм та проектів ', 17.6, 'ДМК', 240, '70х100/16', '2000-02-03', 5000, 'Програмування', 'C&C++\r'),
(222, 235, 'Yes', 'Інформаційні системи і структури даних', NULL, 'Києво-Могилянська академія ', 288, '60х90/16', '2022-03-17', 400, 'Використання ПК в цілому', 'Інші книги\r'),
(225, 8746, 'Yes', 'Бази даних в інформаційних системах', NULL, 'Університет \"Україна\"', 418, '60х84/16', '2018-07-25', 100, 'Програмування', 'SQL\r'),
(226, 2154, 'Yes', 'Сервер на основі операційної системи FreeBSD 6.1 ', 0, 'Університет \"Україна\"', 216, '60х84/16', '2015-03-11', 500, 'Програмування', 'Інші операційні системи\r'),
(245, 2662, 'No', 'Організація баз даних та знань', 0, 'Вінниця: ВДТУ', 208, '60х90/16', '2001-10-10', 1000, 'Програмування', 'SQL\r'),
(247, 5641, 'Yes', 'Організація баз даних та знань', 0, 'Видавнича група BHV', 384, '70х100/16', '2021-12-15', 5000, 'Програмування', 'SQL\r'),
(389, 3877, 'Yes', 'Мова С&C++ для чайників', NULL, 'ДМК', 301, '84х108/32', '2022-06-23', 5000, 'Програмування', 'С&C++'),
(398, 6893, 'No', 'Організація баз даних та знань', 13.45, 'Видавнича група\r\nBHV', 384, '70х100/16', '2000-12-06', 5000, 'Програмування', 'SQL'),
(423, 4598, 'Yes', 'Чиста архітектура. Мистецтво розроблення програмного забезпечення', 18.32, 'Фабула Харків', 368, '84х108/32', '2021-02-01', 5000, 'Програмування', 'Інші книги');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `book`
--
ALTER TABLE `book`
  ADD PRIMARY KEY (`N`),
  ADD KEY `nIndex` (`Код`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
